read_source:
    {%- for source in model_sources %}
    read_verilog {{ source }}
    {%- endfor %}

begin:
    {%- for k, v in model.parameters.items() %}
    chparam -set {{ k }} {{ v }} {{ model.name }}
    {%- endfor %}
    hierarchy -check -top {{ model.name }}

synth:
    tcl {{ yosys_script }}

backend:
    write_blif -conn -param {{ model.name }}.blif
